CSI API ETABS v1
cPointElm.GetRestraint Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetRestraint(
	string Name,
	ref bool[] Value
)
Function GetRestraint (
	Name As String,
	ByRef Value As Boolean()
) As Integer
Dim instance As cPointElm
Dim Name As String
Dim Value As Boolean()
Dim returnValue As Integer
returnValue = instance.GetRestraint(Name,
	Value)
int GetRestraint(
	String^ Name,
	array<bool>^% Value
)
abstract GetRestraint :
        Name : string *
        Value : bool[] byref -> int
Parameters
Name
Type: System.String
Value
Type: System.Boolean[]
Return Value
Type: Int32
See Also
Reference
cPointElm Interface
ETABSv1 Namespace